#пользователь вводит значения
b = float(input("Введите значение первого элемента прогрессии b (от -10000 до 10000): "))
q = float(input("Введите значение знаменателя прогрессии q (от 1 до 50): "))
n = int(input("Введите номер последнего элемента прогрессии n (от 2 до 100): "))
#проверяем введенные значения,чтобы они входили в заданный диапазон
if not (-10000 <= b <= 10000):
    print("Ошибка: b вне диапазона! Начните заново.")
if not (1 <= q <= 50):
    print("Ошибка: q вне диапазона! Начните заново.")
if not (2 <= n <= 100):
    print("Ошибка: n вне диапазона! Начните заново.")
#после проверки вычисляем сумму геометрической прогрессии на основании исходных данных
if q == 1:
#если знаменатель равен 1,то можем сразу умнажать b*n
    e = b * n
else:
#если знаменатель не равен 1,то применяем формулу
    e = b * (q**n - 1) / (q - 1)
print("Результат:", e)