#пользователь вводит данные с клавиатуры
a = int(input("введите число (от 1 до 100000):"))
#проверяем,что число вошло в диапазон
if not ( 1 <= a <= 100000 ):
    print("ошибка: вы ввели число вне диапазона! Начните заново.")
#выделяем единицу, так как она не является простым и составным числом
elif a==1:
    print("Число 1 не является ни простым, ни составным.")
#делаем проверку:если число делится без остатка на какое-то число из диапазона(2,а),то оно не является простым
else: 
    for b in range(2,a):
        if a % b == 0:
           print("число не является простым")
           break
    else:
        print("число простое")
#проверяем:если число входит в диапазон и делится на 3,то мы можем выполнить операцию,чтобы достичь числа 0
if 1<= a <= 100000 and a  %3==0:
    t=0 #задаем переменную,которая будет считать эти шаги
    while a>0: #пока число больше нуля вычитаем из него 3
        a=a-3
        t=t+1 #скаждым вычитанием будем прибавлять 1
    print("количество операций,которые необходимо выполнить, для того, чтобы достичь числа 0:",t)
else: #если число не делится на 3,то оно не подходит
    print("число не подходит для операции:а-3")