a = int(input("введите число (от 1 до 100000):"))
t=0
if not ( 1 <= a <= 100000 ):
    print("ошибка: вы ввели число вне диапазона! Начните заново.")
elif a==1:
    print("Число 1 не является ни простым, ни составным.")
else: 
    for b in range(2,a):
        if a % b == 0:
           print("число не является простым")
           break
    else:
        print("число простое")
if 1<= a <= 100000 and a/3==0:
    t=0
    while a>0:
        a=a-3
        t=t+1
    print("количество операций,которые необходимо выполнить, для того, чтобы достичь числа 0:{t}")
else:
    print("число не подходит для операции:а-3")

  

