#пользователь вводит данные
a = int(input("введите число (от 1 до 25):"))
#проверяем,что число находится в диапазоне
if not ( 1 <= a <= 25 ): #если число не входит в диапазон,то пишем:
    print("ошибка: вы ввели число вне диапазона! Начните заново.")
elif a==1:#выделяем 1,потому что она не явялется ни простым,ни составным
    print("Число 1 не является ни простым, ни составным.")
else: #когда условие выполнилось мы начинаем перебор делителей числа а
    for b in range(2,a):
        if a % b == 0: #если а делитсябез остатка,то оно не является простым
           print("число не является простым")
           break #заканчиваем программу,если число делится без остатка 
    else: #если а не делится,то оно простое
        print("число простое")

                

        

